Repository: eugeneai/bash-essentials-ru-handbok
Catalog: tmx/en-ru-level2.tmx
Source language: en
Languages: ru

source: %CPU - The task’s share of elapsed CPU time since last screen update.
ru: %CPU - Доля использования процессора данным процессом с момента последнего обновления экрана.

source: %CPU - check to make sure a single process is not eating all of your CPU resources
ru: %CPU - поиск процессов, "съедающий" все вычислительные ресурсы вашего процессора.

source: %MEM - The same thing as RES, but expressed as a percentage
ru: %MEM - То же, что и RES, но выражено в процентах

source: %MEM - check to make sure that a single process is not eating all of your memory resources.
ru: %MEM - поиск процессов, "съедающих" все ресурсы оперативной памяти.

source: (1) A resource-driven game based model of a manufacturing process accounting competitive environment of an enterprise, (2) techniques of control synthesizing minimizing deviations of the process execution due to perturbation, (3) new strategies of inference search for positively constructed formulae, (4) new formalized knowledge for model conversion and interpretation represented as objects, (5) computer simulation and visualization system implementing the above mentioned methods and techniques.
ru: (1) Модели производственных процессов на основе ресурсно-=управляемых игр, учитывающие конкурентнцю среду предприятия; (2) методы синтеза управления, минимизирующие отклонения исполняющегося процесса вследствие возникающих возмущений; (3) новые стратегии поиска логического вывода в исчислении позитивно-образованных формул; (4) новые формализованные знания для осуществления преобразования и интерпретации моделей, представленые в виде объектов, (5) программа имитационного моделирования и визуализации, реализующая вышеупомянутые методы и подходы.

source: (1) The inference logic for semantic interpretation is defeasible logic.
ru: (1) Использование немонотонного логического вывода для семантической интерпретации.

source: (2) The reasoning execution method is forward-chaining method.
ru: (2) Метод выполнения рассуждений - от фактов к заключению (forward-chaining).

source: (3) In order to guide the inference targets and directions, business processes (BP) in the form of rules are needed, whose creation is out of the scope of this paper.
ru: (3) Для того, чтобы управлять логический вывод к заданной цели или в определенном русле, требуется формализация бизнес-процессов (БП) также в виде правил[, создание которых выходит за рамки данной статьи].

source: 3 .1 Research problems to be solved
ru: 3 .1 Еаучные проблемы, которые будут решены

source: Menu TOC Share Top
ru: Меню Содержание Поделиться В начало

source: * - Matches 0 or more of the preceding character
ru: * - сопоставляет 0 или больше символа, стоящих в шаблоне слева от символа

source: + - Matches 1 or more of the preceding character
ru: + - сопоставляет 1 или больше -"-

source: . - matches any character
ru: . - соответствует любому символу

source: ? - Matches 0 or 1 of the preceding character
ru: ? - Сопоставляет 0 или 1 символ -"-

source: \d - matches any digit (0, 1, 2, 3, 4, 5, 6, 7, 8, 9)
ru: \d - соответсвует одной из цифр (0, 1, 2, 3, 4, 5, 6, 7, 8, 9)

source: \s - matches any whitespace character (including newlines)
ru: \s - соответствует любым символам, интерпретируемым как "пустое пространство", включая "перевод строки", "возврат каретки"

source: \w - matches any alphanumeric character (letters and numbers)
ru: \w - соответствует любому символу алфавита или цифре

source: {1,} - Matches 1 or more of the preceding character (identical to +)
ru: {1,} - Сопоставляет 1 или больше -"- (так же как +)

source: {1} - Matches exactly 1 of the preceding character
ru: {1} - Сопоставляет в точности 1 символ -"-

source: {2,6} - Matches between 2 and 6 of the preceding character
ru: {2,6} - Сопоставляет от 2 до 6 символов -"-

source: [0-9] represents every possible digit, and is exactly equivalent to \d.
ru: Выражение [0-9] сопоставляется с одной из цифр, и эквивалентна классу \d.

source: dig and host should be installed on your machine already, but you may have to install the whois utility to use it.
ru: Как правило, пргограммы dig и host устанавливаются на компьютер по умолчанию, а вот команду whois, вероятно, придется установить самостоятельно.

source: tar and gz are slightly different.
ru: tar и gz - это разные программы.

source: [0-9a-zA-Z_] represents all alphanumeric characters and is exactly equivalent to \w.
ru: Выражение [0-9a-zA-Z_] представляет все символы английского алфавита и точно эквивалентен \w.

source: tar is an archive format while gz is a compressed format.
ru: tar - это формат архива набора файлов, а gz - это формат сжатия информации.

source: There are MANY ways to write them.
ru: Есть МНОГО способов их написать.

source: (Not all processes could be identified, non-owned process info
ru: (Не все процессы могут быть идентифицированы, информация о процессах, не принадлежащих текущему пользователю

source: 1.1. Shell Variables
ru: 1.1. Переменные оболочки

source: 1.2. PATH variable
ru: 1.2. Переменная PATH

source: 1.3.2. awk and sed
ru: 1.3.2. awk и sed

source: 1.3.4. find and exec
ru: 1.3.4. find и exec

source: 1.3. Common Commands
ru: 1.3. Общие команды

source: 1. Environment variables
ru: 1. Переменные среды

source: 2.1.1. Detailed Example Regular Expression
ru: 2.1.1. Подробный пример регулярных выражений

source: 2.1. Regular Expressions
ru: 2.1. Обычные выражения

source: 2.2.1. Variable declarations
ru: 2.2.1. Объявления переменных

source: 2.2.2. Built-In Variables
ru: 2.2.2. Встроенные переменные

source: 2.2.3. Command Line Arguments
ru: 2.2.3. Аргументы командной строки

source: 2.2.4. Reading user input
ru: 2.2.4. Чтение ввода с клавиатуры

source: 2.2.5. for loops
ru: 2.2.5. циклы for

source: 2.2.6. if-then statements
ru: 2.2.6. операторы if-then

source: 2.2.7. Functions
ru: 2.2.7. Функции

source: 2.2. Bash Scripting
ru: 2.2. Сценарии Bash

source: 2.3.2. From local computer to remote machine
ru: 2.3.2. С локального компьютера на удаленный

source: 2.3.3. From remote machine to local computer
ru: 2.3.3. С удаленного компьютера на локальный

source: 2.3.4. Downloading packages to your remote machine with wget
ru: 2.3.4. Загрузка пакетов на удаленный компьютер при помощи wget

source: 2.3.5. Using VSCode with your remote machine
ru: 2.3.5. Использование VSCode на удаленной машине

source: 2.3. Virtual Machines and SSH Protocol
ru: 2.3. Виртуальные машины и протокол SSH

source: 2.4.1. Your home network and the internet
ru: 2.4.1. Ваша домашняя сеть и Интернет

source: 2.4. Networking on Command Line
ru: 2.4. Работа в сети в командной строке

source: 2.5.1. What is a Process?
ru: 2.5.1. Что такое процесс?

source: 2.5.2. Processes Behind the Scenes
ru: 2.5.2. Процессы: что за кулисами

source: 2.5.3. Foreground vs. Background Processes
ru: 2.5.3. Процессы на переднем плане и фоновые процессы

source: 2.5.4. ps and top commands (system performance management)
ru: 2.5.4. команды ps и top (управление производительностью системы)

source: 2.5. Process Management and System Management
ru: 2.5.Управление процессами и управление системой

source: 2.6. Conclusion
ru: 2.6. Заключение

source: 2. Advanced Bash
ru: 2. дополнительные возмодности Баш

source: # And finally, the same expression written in the bash shell using the grep command
ru: # И, наконец, то же выражение в оболочке bash с помощью команды grep

source: # Create a .tar format archive
ru: # Создяние .tar-архива

source: # Finds all jpg files on your system
ru: # Найти все .jpg-файлы на компьютере

source: # List all the files that the user zach has open
ru: # Список всех файлов, которые открыл пользователь zach

source: # Loads necessary environment variables
ru: # Загружает необходимые переменные среды

source: # Must use sudo because this file is protected
ru: # Необходимо использовать sudo, потому что этот файл защищен

source: # Only displays the user "zach"'s processes
ru: # Показывает процессы пользователя "zach"

source: # Outputs the same thing as
ru: # Выводится то же самое, что в результате звапуска

source: # Pipe output into less
ru: # Передача выходных данных в less из другой программы

source: # Single letter
ru: # Одна буква

source: # Stops process
ru: # Останавливает процесс

source: # This is an awk comment
ru: # Это комментарий в программе awk

source: # This is the same regexp, but in Python
ru: # Это то же регулярное выражение, но в Python

source: # You might think that this will match, but it does not.
ru: # Можно подумать, что это выражение соответствует строке, но это не так.

source: // This is how we use a javascript regular expression to match a string with 3 or more digits in it
ru: // Пример использования регулярных выражений в Javascript для сопоставления строки с шаблоном "3 или более цифры"

source: echo $0 # Prints the name of the script - shell-scripting-basics.sh
ru: echo $0 # Вывести наименование скрипта - shell-scripting-basics.sh

source: MY_SHELL_VARIABLE="some value"
ru: MY_SHELL_VARIABLE="значение"

source: MY_VARIABLE="some value"
ru: MY_VARIABLE="значение"

source: Previous post Next post Back to top Share post
ru: Предыдущий пост Следующий пост Вернуться наверх Поделиться публикацией

source: echo $MY_VARIABLE # some value
ru: echo $MY_VARIABLE # значение

source: export MY_VARIABLE="some value"
ru: export MY_VARIABLE="значение"

source: echo "a" | grep -P "^\w" # matches!
ru: echo "a" | grep -P "^\w" # соответствие!/s107>

source: echo "a" | grep -P "^\w+" # matches!
ru: echo "a" | grep -P "^\w+" # соответствие!

source: ... omitted for brevity ...
ru: ... пропущены аналогичные записи ...

source: # List what is in .tar archive
ru: # Перечислить файлы в архиве .tar

source: echo $2 # Prints the second argument given to a script
ru: echo $2 # Вывести второй аргумент скрипта

source: not an email address
ru: не адрес электронной почты

source: echo "a" | grep -P "^\w*" # matches!
ru: echo "a" | grep -P "^\w*" # соответствие!

source: # Notice how each line is ended with a semicolon -- similar to C programming language
ru: # Обратите внимание, каждая строка заканчивается символом ";", что приближает этот скрипт к языку программирования C.

source: echo "a" | grep -P "^\w?" # matches!
ru: echo "a" | grep -P "^\w?" # соответствие!

source: echo "a" | grep -P "^\w{1}" # matches!
ru: echo "a" | grep -P "^\w{1}" # соответствие!

source: echo "a" | grep -P "^\w{1,}" # matches!
ru: echo "a" | grep -P "^\w{1,}" # соответствие!

source: echo "a" | grep -P "^\w{0,1}" # matches!
ru: echo "a" | grep -P "^\w{0,1}" # соответствие!

source: # The * refers to all the files and directories in the current directory
ru: # Символ * обозначает все файы и подкаталоги в текущем каталоге

source: # This expression does match!
ru: # А вот это выражение соответствует!

source: # t is list mode
ru: # t - режим списка

source: echo "The user entered: $user_input"
ru: echo "Пользователь ввел: $user_input"

source: # Another use of metacharacters (matching anything that is not a digit)
ru: # Другое использование метасимволов (соответствие чему-либо, кроме цифр)

source: # No arguments were passed to function
ru: # Функции не были переданы аргументы

source: # List all processes running on port 22
ru: # Список всех процессов, осуществляющих сервис на порту 22

source: # This is the Google Chrome Process (this comment was manually added to ps output)
ru: # Вот процесс Google Chrome (этот комментарий был вручную добавлен в текст ответа команды ps)

source: echo 'But not single-quoted strings.
ru: echo 'Но не в строки, ограниченные одинарными кавычками.

source: echo "a" | grep -P "^\D" # matches!
ru: echo "a" | grep -P "^\D" # соответствие!

source: echo "a" | grep -P "^\D+" # matches!
ru: echo "a" | grep -P "^\D+" # соответствие!

source: # Login
ru: # Подключение

source: echo "a" | grep -P "^a*" # matches!
ru: echo "a" | grep -P "^a*" # соответствие!

source: echo $3 # Prints the third... do I need to continue here???
ru: echo $3 # Вывести третий... надо далее продолжать???

source: echo "a" | grep -P "^\D*" # matches!
ru: echo "a" | grep -P "^\D*" # соответствие!

source: echo "a" | grep -P "^\D?" # matches!
ru: echo "a" | grep -P "^\D?" # соответствие!

source: # Brings process to foreground
ru: # Перевод процесса в фоновый режим

source: # This script is basically the `ls` command
ru: # Этот скрипт, по сути, команда `ls`

source: echo "a" | grep -P "^\D{1}" # matches!
ru: echo "a" | grep -P "^\D{1}" # соответствие!

source: echo "I am a function and no arguments were passed to me"
ru: эхо «Я - функция, и мне не было передано никаких аргументов»

source: # Find all files that belong to zach
ru: # Найти все файлы, которые принадлежат пользователю zach

source: echo "a" | grep -P "^\D{1,}" # matches!
ru: echo "a" | grep -P "^\D{1,}" # соответствие!

source: echo "a" | grep -P "^\D{0,1}" # matches!
ru: echo "a" | grep -P "^\D{0,1}" # соответствие!

source: # 10 different ways to match the same word
ru: # 10 разных способов найти одно и то же слово

source: echo "regexp" | grep -P "regexp" # matches!
ru: echo "regexp" | grep -P "regexp" # соответствие!

source: echo "regexp" | grep -P "^regexp" # matches!
ru: echo "regexp" | grep -P "^regexp" # соответствие!

source: echo "regexp" | grep -P "^reg\w*" # matches!
ru: echo "regexp" | grep -P "^reg\w*" # соответствие!

source: echo "$name is a directory!"
ru: echo "$name - это каталог!"

source: # To unpack a .tar file
ru: # Распаковка .tar-файла

source: echo $# # Prints the number of arguments passed to the script
ru: echo $# # Выводит количество аргументов, переданных скрипту

source: echo "regexp" | grep -P "^reg\w*$" # matches!
ru: echo "regexp" | grep -P "^reg\w*$" # соответствие!

source: # List all the files that my external hard drive has open
ru: # Список всех файлов, открытых на моем внешнем жестком диске

source: echo "a" | grep -P "^a?" # matches!
ru: echo "a" | grep -P "^a?" # соответствие!

source: echo "regexp" | grep -P "^\w*$" # matches!
ru: echo "regexp" | grep -P "^\w*$" # соответствие!

source: echo "regexp" | grep -P "\w*" # matches!
ru: echo "regexp" | grep -P "\w*" # соответствие!

source: echo "regexp" | grep -P "^\w+" # matches!
ru: echo "regexp" | grep -P "^\w+" # соответствие!

source: echo "regexp" | grep -P "^regex\w?$" # matches!
ru: echo "regexp" | grep -P "^regex\w?$" # соответствие!

source: # x is extract mode, v is verbose output, f is tar format
ru: # x - разархивировать, v - подробный вывод, f - tar-формат

source: echo "regexp" | grep -P "\D{1,}" # matches!
ru: echo "regexp" | grep -P "\D{1,}" # соответствие!

source: # At least 1 argument was passed to me, so i will print all of them
ru: # Передан как минимум один аргумент, производим печать их всех

source: +++ exited with 0 +++
ru: +++ завершается скодом 0 +++

source: # Check if today's folder is already created
ru: # Проверить, создана ли папка с текущей датой

source: # The +f -- means that we are treating the following as a mount point
ru: # комбинация "+f --" означает, что остаток команды (после "--") - это точка монтирования

source: echo "regexp" | grep -P "^\S{1}\w+$" # matches!
ru: echo "regexp" | grep -P "^\S{1}\w+$" # соответствие!

source: # Find all files with 777 permissions
ru: # Найти все файлы с кодом разрешений 777

source: echo $@ # Prints all arguments passed to the script
ru: echo $@ # Выводит все аргументы, переданные скрипту

source: echo "here"
ru: echo "я здесь"

source: echo "a" | grep -P "^a{1}" # matches!
ru: echo "a" | grep -P "^a{1}" # соответствие!

source: echo "$name is a file!"
ru: echo "$name - это файл!"

source: # NR > 1 means that we only want to print the following bracket enclosed values for lines that are greater
ru: # NR > 1 означает, что надо распечатать значения из строк, номера которых больше 1.

source: will not be shown, you would have to be root to see it all.)
ru: не будут отображаться, нужно быть root-ом, чтобы увидеть их все.)

source: # I am a useless script for tutorial purposes only
ru: # Я не совсем полезный скрипт, предназначенный исключительно для демонстрации.

source: some input
ru: введенные данные

source: # Compress a file or archive
ru: # Сжать файл или архив

source: echo $$ # Prints the process ID
ru: echo $$ # Выводит число - идентификатор процесса (process ID)

source: # Find all files that start with the word config
ru: # Найти все файлы, имена которых начинаются со слова config

source: echo "a" | grep -P "^a{1,}" # matches!
ru: echo "a" | grep -P "^a{1,}" # соответствие!

source: gzip archive.tar # creates archive.tar.gz
ru: gzip archive.tar # создать archive.tar.gz

source: # We want to print the first, second, and seventh value in each line.
ru: # Выводим первое, второе и седьмое значение их каждой строки.

source: # Prints the exit code of the previous process run
ru: # Выводит код завершения предыдущего процесса

source: # Uncompress
ru: # Разархивация

source: echo "a" | grep -P "^a{0,1}" # matches!
ru: echo "a" | grep -P "^a{0,1}" # соответствие!

source: # 1 or more period characters starting at the beginning of the line.
ru: # олдному или более символам "точка", находящихся в начале строки.

source: # Before processing any text, we want to set the FS variable (what our file is separated by),
ru: # Перед тем, как непосредственно перейти к обработке текста установим переменную FS (задает символ-резделитель колонок),

source: # The -i flag will make my search case insensitive
ru: # Флаг (ключ) -i переводит поиск в режим игнорирования размера букв

source: # `kill -19 21124` also works
ru: # `kill -19 21124` также работает

source: # c is create mode, v is verbose output, f is tar format
ru: # c - создать, v - подробный вывод, f - формат tar

source: # second ^ (inside the brackets) means "not".
ru: # второй "^" (внутри квадратных скобок) означает "отрияание" (дополнение).

source: echo "I am a useless script for tutorial purposes only"
ru: echo "Я не совсем полезный скрипт, предназначенный исключительно для демонстрации."

source: echo "a" | grep -P "^a" # matches!
ru: echo "a" | grep -P "^a" # соответствие!

source: # I can return a value that can be retrieved later with the $?
ru: # Возврат значения изфункции, которое доступно позже с помощью встроенной переменной $?

source: # A bit of a tricky expression here.
ru: # Здесь немного замудреное выражение.

source: # into a do-while loop because the find exec command gets a permission denied error when running it as a script
ru: # в цикл do-while, потому что команда exec в find приводит к ошибке отказа в доступе, если запущена в скрипте

source: # Double letter
ru: # Двойная буква

source: # Output
ru: # Результат

source: # The script ./shell-scripting-basics.sh evaluates to: 12
ru: # Скрипт ./shell-scripting-basics.sh вычисляется в: 12

source: Active Internet connections (w/o servers)
ru: Активные интернет-соединения (без серверов)

source: The user entered: some input
ru: Пользователь ввел: введенные данные

source: # calling our function
ru: # вызов функции

source: echo "aa" | grep -P "^a" # Only matches first letter
ru: echo "aa" | grep -P "^a" # Соответствует первая буква только

source: echo "aa" | grep -P "^a+" # matches!
ru: echo "aa" | grep -P "^a+" # соответствие!

source: # calling our function with arguments
ru: # вызов нашей функции с аргументами

source: # Navigate to the home directory
ru: # Перейти в домашний каталог

source: # Output ---
ru: # Результат ---

source: # Reading the user's input into the user_input variable
ru: # Производим чтение пользовательских данных в переменную_input

source: echo "The script $0 evaluates to: " $(($1+$2))
ru: echo "Скрипт $0 вычисляет: " $(($1+$2))

source: echo $1 # Prints the first argument given to a script
ru: echo $1 # Выводит первый аргумент скрипта

source: echo $MY_SHELL_VARIABLE # some value
ru: echo $MY_SHELL_VARIABLE # значение

source: export GLOBAL_VARIABLE="some value"
ru: export GLOBAL_VARIABLE="значение"

source: n # repeats the search for -exec and finds next occurrence of it
ru: п # повторяет поиск для строки -exec и находит следующее его вхождение

source: some_function "argument 1" "argument 2"
ru: some_function "аргумент 1" "аргумент 2"

source: echo "aa" | grep -P "^a*" # matches!
ru: echo "aa" | grep -P "^a*" # соответствие!

source: # Printing the return value of 20
ru: # Печать возвращаемого значения 20

source: echo "aa" | grep -P "^a?" # Only matches the first letter
ru: echo "aa" | grep -P "^a?" # Только первая буква соответствует

source: # If you pass arguments to me, I can print them
ru: # Если вы передадите аргументы в эту функцию, то функция их распечатает

source: # This reads the awk-example.sh file and executes it against aapl.csv
ru: # Загружаем программу из awk-example.sh, применяем ее к файлу AAPL.csv.csv

source: # the OFS variable (what our output is separated by), and then print a header for our output.
ru: # переменную OFS (символ-резделитель в выходных данных), и затем распечатаем заголовок текста в порождаемом результате.

source: # will match 1 or more characters starting at the beginning of the line that
ru: # будет соответствовать одному или более символам, начиная с начала строки,

source: echo "aa" | grep -P "^a{1}" # Only matches the first letter
ru: echo "aa" | grep -P "^a{1}" # Сопоставяется только первая буква

source: # List all network connections
ru: # Список всех сетевых подключений

source: # Only displays the process 22435
ru: # Показывает процесс с номером 22435

source: # Use less directly
ru: # Использование less напрямую

source: echo "aa" | grep -P "^a{1,}" # matches!
ru: echo "aa" | grep -P "^a{1,}" # соответствие!

source: echo "aa" | grep -P "^a{0,1}" # Only matches the first letter
ru: echo "aa" | grep -P "^a{0,1}" # Сопоставляется только первая буква

source: # Adds ssh key
ru: # Добавляется ssh key

source: # Starts process
ru: # Запускает процесс

source: echo "aa" | grep -P "^a{0,1}$" # Does not match at all!
ru: echo "aa" | grep -P "^a{0,1}$" # Нет никакого соответствия!

source: echo "2 does equal 2!"
ru: echo "2 действительно равно 2!"

source: # Finds all files modified in the last day
ru: # Найти все файлы, измененные за прошедшие сутки

source: # First check if the archives folder exists
ru: # Сначала проверить, существует ли папка с архивами

source: # are not digits.
ru: # не являющихся цифрами.

source: echo "Variables can also be added within double-quoted strings: $MY_VARIABLE"
ru: echo "Переменные также могут использоваться в строках, ограниченных двойными кавычками: $MY_VARIABLE"

source: echo "a" | grep -P "^a+" # matches!
ru: echo "a" | grep -P "^a+" # соответствие!

source: A MiSeq SOP automation approach
ru: Подход к автоматизации MiSeq SOP

source: A comprehensive review of present sequencing approaches and challenges are described in [1].
ru: Подробный обзор современных подходов к секвенированию и проблем представлен в [1].

source: A comprehensive review of quality control, error correction and detection while processing NGS data is presented in [11].
ru: Подробный обзор контроля качества, обнаружеения исправления ошибок при обработке данных NGS представлен в [11].

source: A comprehensive short survey can be found in [17] but it does not add essential data to ours.
ru: Подробный обзор можно найти в [17], но он не добавляет существенных данных к нашему.

source: A computational process is descried as an abstract program implementing within a problem-solving scheme.
ru: Вычислительный процесс описывается как абстрактная программа, реализующая в схему решения задачи.

source: A global environment variable is one that is set upon initialization of a shell and can be used across all your shells.
ru: Глобальная переменная среды - это переменная, которая устанавливается при инициализации оболочки и может использоваться во всех дочерних скриптах.
